docs/experiments/results/exp-v2-async/k6/medium_10rps-run2-stdout.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /opt/image-pipeline-k6/image-pipeline-v2.js
        output: -

     scenarios: (100.00%) 1 scenario, 240 max VUs, 2m30s max duration (incl. graceful stop):
              * medium_10rps: 10.00 iterations/s for 2m0s (maxVUs: 80-240, gracefulStop: 30s)


running (0m00.9s), 010/080 VUs, 0 complete and 0 interrupted iterations
medium_10rps   [   1% ] 010/080 VUs  0m00.9s/2m0s  10.00 iters/s

running (0m01.9s), 020/080 VUs, 0 complete and 0 interrupted iterations
medium_10rps   [   2% ] 020/080 VUs  0m01.9s/2m0s  10.00 iters/s

running (0m02.9s), 030/080 VUs, 0 complete and 0 interrupted iterations
medium_10rps   [   2% ] 030/080 VUs  0m02.9s/2m0s  10.00 iters/s

running (0m03.9s), 040/080 VUs, 0 complete and 0 interrupted iterations
medium_10rps   [   3% ] 040/080 VUs  0m03.9s/2m0s  10.00 iters/s

running (0m04.9s), 050/080 VUs, 0 complete and 0 interrupted iterations
medium_10rps   [   4% ] 050/080 VUs  0m04.9s/2m0s  10.00 iters/s

running (0m05.9s), 013/080 VUs, 47 complete and 0 interrupted iterations
medium_10rps   [   5% ] 013/080 VUs  0m05.9s/2m0s  10.00 iters/s

running (0m06.9s), 016/080 VUs, 54 complete and 0 interrupted iterations
medium_10rps   [   6% ] 016/080 VUs  0m06.9s/2m0s  10.00 iters/s

running (0m07.9s), 014/080 VUs, 66 complete and 0 interrupted iterations
medium_10rps   [   7% ] 014/080 VUs  0m07.9s/2m0s  10.00 iters/s

running (0m08.9s), 014/080 VUs, 76 complete and 0 interrupted iterations
medium_10rps   [   7% ] 014/080 VUs  0m08.9s/2m0s  10.00 iters/s

running (0m09.9s), 013/080 VUs, 87 complete and 0 interrupted iterations
medium_10rps   [   8% ] 013/080 VUs  0m09.9s/2m0s  10.00 iters/s

running (0m10.9s), 012/080 VUs, 98 complete and 0 interrupted iterations
medium_10rps   [   9% ] 012/080 VUs  0m10.9s/2m0s  10.00 iters/s

running (0m11.9s), 012/080 VUs, 108 complete and 0 interrupted iterations
medium_10rps   [  10% ] 012/080 VUs  0m11.9s/2m0s  10.00 iters/s

running (0m12.9s), 011/080 VUs, 119 complete and 0 interrupted iterations
medium_10rps   [  11% ] 011/080 VUs  0m12.9s/2m0s  10.00 iters/s

running (0m13.9s), 012/080 VUs, 128 complete and 0 interrupted iterations
medium_10rps   [  12% ] 012/080 VUs  0m13.9s/2m0s  10.00 iters/s

running (0m14.9s), 012/080 VUs, 138 complete and 0 interrupted iterations
medium_10rps   [  12% ] 012/080 VUs  0m14.9s/2m0s  10.00 iters/s

running (0m15.9s), 011/080 VUs, 149 complete and 0 interrupted iterations
medium_10rps   [  13% ] 011/080 VUs  0m15.9s/2m0s  10.00 iters/s

running (0m16.9s), 011/080 VUs, 159 complete and 0 interrupted iterations
medium_10rps   [  14% ] 011/080 VUs  0m16.9s/2m0s  10.00 iters/s

running (0m17.9s), 011/080 VUs, 169 complete and 0 interrupted iterations
medium_10rps   [  15% ] 011/080 VUs  0m17.9s/2m0s  10.00 iters/s

running (0m18.9s), 012/080 VUs, 178 complete and 0 interrupted iterations
medium_10rps   [  16% ] 012/080 VUs  0m18.9s/2m0s  10.00 iters/s

running (0m19.9s), 012/080 VUs, 188 complete and 0 interrupted iterations
medium_10rps   [  17% ] 012/080 VUs  0m19.9s/2m0s  10.00 iters/s

running (0m20.9s), 011/080 VUs, 199 complete and 0 interrupted iterations
medium_10rps   [  17% ] 011/080 VUs  0m20.9s/2m0s  10.00 iters/s

running (0m21.9s), 012/080 VUs, 208 complete and 0 interrupted iterations
medium_10rps   [  18% ] 012/080 VUs  0m21.9s/2m0s  10.00 iters/s

running (0m22.9s), 011/080 VUs, 219 complete and 0 interrupted iterations
medium_10rps   [  19% ] 011/080 VUs  0m22.9s/2m0s  10.00 iters/s

running (0m23.9s), 012/080 VUs, 228 complete and 0 interrupted iterations
medium_10rps   [  20% ] 012/080 VUs  0m23.9s/2m0s  10.00 iters/s

running (0m24.9s), 011/080 VUs, 239 complete and 0 interrupted iterations
medium_10rps   [  21% ] 011/080 VUs  0m24.9s/2m0s  10.00 iters/s

running (0m25.9s), 011/080 VUs, 249 complete and 0 interrupted iterations
medium_10rps   [  22% ] 011/080 VUs  0m25.9s/2m0s  10.00 iters/s

running (0m26.9s), 011/080 VUs, 259 complete and 0 interrupted iterations
medium_10rps   [  22% ] 011/080 VUs  0m26.9s/2m0s  10.00 iters/s

running (0m27.9s), 011/080 VUs, 269 complete and 0 interrupted iterations
medium_10rps   [  23% ] 011/080 VUs  0m27.9s/2m0s  10.00 iters/s

running (0m28.9s), 011/080 VUs, 279 complete and 0 interrupted iterations
medium_10rps   [  24% ] 011/080 VUs  0m28.9s/2m0s  10.00 iters/s

running (0m29.9s), 012/080 VUs, 288 complete and 0 interrupted iterations
medium_10rps   [  25% ] 012/080 VUs  0m29.9s/2m0s  10.00 iters/s

running (0m30.9s), 011/080 VUs, 299 complete and 0 interrupted iterations
medium_10rps   [  26% ] 011/080 VUs  0m30.9s/2m0s  10.00 iters/s

running (0m31.9s), 012/080 VUs, 308 complete and 0 interrupted iterations
medium_10rps   [  27% ] 012/080 VUs  0m31.9s/2m0s  10.00 iters/s

running (0m32.9s), 011/080 VUs, 319 complete and 0 interrupted iterations
medium_10rps   [  27% ] 011/080 VUs  0m32.9s/2m0s  10.00 iters/s

running (0m33.9s), 011/080 VUs, 329 complete and 0 interrupted iterations
medium_10rps   [  28% ] 011/080 VUs  0m33.9s/2m0s  10.00 iters/s

running (0m34.9s), 011/080 VUs, 339 complete and 0 interrupted iterations
medium_10rps   [  29% ] 011/080 VUs  0m34.9s/2m0s  10.00 iters/s

running (0m35.9s), 011/080 VUs, 349 complete and 0 interrupted iterations
medium_10rps   [  30% ] 011/080 VUs  0m35.9s/2m0s  10.00 iters/s

running (0m36.9s), 011/080 VUs, 359 complete and 0 interrupted iterations
medium_10rps   [  31% ] 011/080 VUs  0m36.9s/2m0s  10.00 iters/s

running (0m37.9s), 011/080 VUs, 369 complete and 0 interrupted iterations
medium_10rps   [  32% ] 011/080 VUs  0m37.9s/2m0s  10.00 iters/s

running (0m38.9s), 011/080 VUs, 379 complete and 0 interrupted iterations
medium_10rps   [  32% ] 011/080 VUs  0m38.9s/2m0s  10.00 iters/s

running (0m39.9s), 011/080 VUs, 389 complete and 0 interrupted iterations
medium_10rps   [  33% ] 011/080 VUs  0m39.9s/2m0s  10.00 iters/s

running (0m40.9s), 011/080 VUs, 399 complete and 0 interrupted iterations
medium_10rps   [  34% ] 011/080 VUs  0m40.9s/2m0s  10.00 iters/s

running (0m41.9s), 011/080 VUs, 409 complete and 0 interrupted iterations
medium_10rps   [  35% ] 011/080 VUs  0m41.9s/2m0s  10.00 iters/s

running (0m42.9s), 011/080 VUs, 419 complete and 0 interrupted iterations
medium_10rps   [  36% ] 011/080 VUs  0m42.9s/2m0s  10.00 iters/s

running (0m43.9s), 011/080 VUs, 429 complete and 0 interrupted iterations
medium_10rps   [  37% ] 011/080 VUs  0m43.9s/2m0s  10.00 iters/s

running (0m44.9s), 011/080 VUs, 439 complete and 0 interrupted iterations
medium_10rps   [  37% ] 011/080 VUs  0m44.9s/2m0s  10.00 iters/s

running (0m45.9s), 011/080 VUs, 449 complete and 0 interrupted iterations
medium_10rps   [  38% ] 011/080 VUs  0m45.9s/2m0s  10.00 iters/s

running (0m46.9s), 011/080 VUs, 459 complete and 0 interrupted iterations
medium_10rps   [  39% ] 011/080 VUs  0m46.9s/2m0s  10.00 iters/s

running (0m47.9s), 011/080 VUs, 469 complete and 0 interrupted iterations
medium_10rps   [  40% ] 011/080 VUs  0m47.9s/2m0s  10.00 iters/s

running (0m48.9s), 011/080 VUs, 479 complete and 0 interrupted iterations
medium_10rps   [  41% ] 011/080 VUs  0m48.9s/2m0s  10.00 iters/s

running (0m49.9s), 011/080 VUs, 489 complete and 0 interrupted iterations
medium_10rps   [  42% ] 011/080 VUs  0m49.9s/2m0s  10.00 iters/s

running (0m50.9s), 011/080 VUs, 499 complete and 0 interrupted iterations
medium_10rps   [  42% ] 011/080 VUs  0m50.9s/2m0s  10.00 iters/s

running (0m51.9s), 012/080 VUs, 508 complete and 0 interrupted iterations
medium_10rps   [  43% ] 012/080 VUs  0m51.9s/2m0s  10.00 iters/s

running (0m52.9s), 011/080 VUs, 519 complete and 0 interrupted iterations
medium_10rps   [  44% ] 011/080 VUs  0m52.9s/2m0s  10.00 iters/s

running (0m53.9s), 011/080 VUs, 529 complete and 0 interrupted iterations
medium_10rps   [  45% ] 011/080 VUs  0m53.9s/2m0s  10.00 iters/s

running (0m54.9s), 011/080 VUs, 539 complete and 0 interrupted iterations
medium_10rps   [  46% ] 011/080 VUs  0m54.9s/2m0s  10.00 iters/s

running (0m55.9s), 011/080 VUs, 549 complete and 0 interrupted iterations
medium_10rps   [  47% ] 011/080 VUs  0m55.9s/2m0s  10.00 iters/s

running (0m56.9s), 011/080 VUs, 559 complete and 0 interrupted iterations
medium_10rps   [  47% ] 011/080 VUs  0m56.9s/2m0s  10.00 iters/s

running (0m57.9s), 011/080 VUs, 569 complete and 0 interrupted iterations
medium_10rps   [  48% ] 011/080 VUs  0m57.9s/2m0s  10.00 iters/s

running (0m58.9s), 011/080 VUs, 579 complete and 0 interrupted iterations
medium_10rps   [  49% ] 011/080 VUs  0m58.9s/2m0s  10.00 iters/s

running (0m59.9s), 011/080 VUs, 589 complete and 0 interrupted iterations
medium_10rps   [  50% ] 011/080 VUs  0m59.9s/2m0s  10.00 iters/s

running (1m00.9s), 011/080 VUs, 599 complete and 0 interrupted iterations
medium_10rps   [  51% ] 011/080 VUs  1m00.9s/2m0s  10.00 iters/s

running (1m01.9s), 012/080 VUs, 608 complete and 0 interrupted iterations
medium_10rps   [  52% ] 012/080 VUs  1m01.9s/2m0s  10.00 iters/s

running (1m02.9s), 011/080 VUs, 619 complete and 0 interrupted iterations
medium_10rps   [  52% ] 011/080 VUs  1m02.9s/2m0s  10.00 iters/s

running (1m03.9s), 011/080 VUs, 629 complete and 0 interrupted iterations
medium_10rps   [  53% ] 011/080 VUs  1m03.9s/2m0s  10.00 iters/s

running (1m04.9s), 011/080 VUs, 639 complete and 0 interrupted iterations
medium_10rps   [  54% ] 011/080 VUs  1m04.9s/2m0s  10.00 iters/s

running (1m05.9s), 011/080 VUs, 649 complete and 0 interrupted iterations
medium_10rps   [  55% ] 011/080 VUs  1m05.9s/2m0s  10.00 iters/s

running (1m06.9s), 011/080 VUs, 659 complete and 0 interrupted iterations
medium_10rps   [  56% ] 011/080 VUs  1m06.9s/2m0s  10.00 iters/s

running (1m07.9s), 012/080 VUs, 668 complete and 0 interrupted iterations
medium_10rps   [  57% ] 012/080 VUs  1m07.9s/2m0s  10.00 iters/s

running (1m08.9s), 014/080 VUs, 676 complete and 0 interrupted iterations
medium_10rps   [  57% ] 014/080 VUs  1m08.9s/2m0s  10.00 iters/s

running (1m09.9s), 011/080 VUs, 689 complete and 0 interrupted iterations
medium_10rps   [  58% ] 011/080 VUs  1m09.9s/2m0s  10.00 iters/s

running (1m10.9s), 011/080 VUs, 699 complete and 0 interrupted iterations
medium_10rps   [  59% ] 011/080 VUs  1m10.9s/2m0s  10.00 iters/s

running (1m11.9s), 011/080 VUs, 709 complete and 0 interrupted iterations
medium_10rps   [  60% ] 011/080 VUs  1m11.9s/2m0s  10.00 iters/s

running (1m12.9s), 011/080 VUs, 719 complete and 0 interrupted iterations
medium_10rps   [  61% ] 011/080 VUs  1m12.9s/2m0s  10.00 iters/s

running (1m13.9s), 011/080 VUs, 729 complete and 0 interrupted iterations
medium_10rps   [  62% ] 011/080 VUs  1m13.9s/2m0s  10.00 iters/s

running (1m14.9s), 011/080 VUs, 739 complete and 0 interrupted iterations
medium_10rps   [  62% ] 011/080 VUs  1m14.9s/2m0s  10.00 iters/s

running (1m15.9s), 011/080 VUs, 749 complete and 0 interrupted iterations
medium_10rps   [  63% ] 011/080 VUs  1m15.9s/2m0s  10.00 iters/s

running (1m16.9s), 012/080 VUs, 758 complete and 0 interrupted iterations
medium_10rps   [  64% ] 012/080 VUs  1m16.9s/2m0s  10.00 iters/s

running (1m17.9s), 011/080 VUs, 769 complete and 0 interrupted iterations
medium_10rps   [  65% ] 011/080 VUs  1m17.9s/2m0s  10.00 iters/s

running (1m18.9s), 011/080 VUs, 779 complete and 0 interrupted iterations
medium_10rps   [  66% ] 011/080 VUs  1m18.9s/2m0s  10.00 iters/s

running (1m19.9s), 011/080 VUs, 789 complete and 0 interrupted iterations
medium_10rps   [  67% ] 011/080 VUs  1m19.9s/2m0s  10.00 iters/s

running (1m20.9s), 011/080 VUs, 799 complete and 0 interrupted iterations
medium_10rps   [  67% ] 011/080 VUs  1m20.9s/2m0s  10.00 iters/s

running (1m21.9s), 012/080 VUs, 808 complete and 0 interrupted iterations
medium_10rps   [  68% ] 012/080 VUs  1m21.9s/2m0s  10.00 iters/s

running (1m22.9s), 011/080 VUs, 819 complete and 0 interrupted iterations
medium_10rps   [  69% ] 011/080 VUs  1m22.9s/2m0s  10.00 iters/s

running (1m23.9s), 011/080 VUs, 829 complete and 0 interrupted iterations
medium_10rps   [  70% ] 011/080 VUs  1m23.9s/2m0s  10.00 iters/s

running (1m24.9s), 011/080 VUs, 839 complete and 0 interrupted iterations
medium_10rps   [  71% ] 011/080 VUs  1m24.9s/2m0s  10.00 iters/s

running (1m25.9s), 011/080 VUs, 849 complete and 0 interrupted iterations
medium_10rps   [  72% ] 011/080 VUs  1m25.9s/2m0s  10.00 iters/s

running (1m26.9s), 011/080 VUs, 859 complete and 0 interrupted iterations
medium_10rps   [  72% ] 011/080 VUs  1m26.9s/2m0s  10.00 iters/s

running (1m27.9s), 011/080 VUs, 869 complete and 0 interrupted iterations
medium_10rps   [  73% ] 011/080 VUs  1m27.9s/2m0s  10.00 iters/s

running (1m28.9s), 011/080 VUs, 879 complete and 0 interrupted iterations
medium_10rps   [  74% ] 011/080 VUs  1m28.9s/2m0s  10.00 iters/s

running (1m29.9s), 011/080 VUs, 889 complete and 0 interrupted iterations
medium_10rps   [  75% ] 011/080 VUs  1m29.9s/2m0s  10.00 iters/s

running (1m30.9s), 011/080 VUs, 899 complete and 0 interrupted iterations
medium_10rps   [  76% ] 011/080 VUs  1m30.9s/2m0s  10.00 iters/s

running (1m31.9s), 012/080 VUs, 908 complete and 0 interrupted iterations
medium_10rps   [  77% ] 012/080 VUs  1m31.9s/2m0s  10.00 iters/s

running (1m32.9s), 011/080 VUs, 919 complete and 0 interrupted iterations
medium_10rps   [  77% ] 011/080 VUs  1m32.9s/2m0s  10.00 iters/s

running (1m33.9s), 011/080 VUs, 929 complete and 0 interrupted iterations
medium_10rps   [  78% ] 011/080 VUs  1m33.9s/2m0s  10.00 iters/s

running (1m34.9s), 011/080 VUs, 939 complete and 0 interrupted iterations
medium_10rps   [  79% ] 011/080 VUs  1m34.9s/2m0s  10.00 iters/s

running (1m35.9s), 011/080 VUs, 949 complete and 0 interrupted iterations
medium_10rps   [  80% ] 011/080 VUs  1m35.9s/2m0s  10.00 iters/s

running (1m36.9s), 011/080 VUs, 959 complete and 0 interrupted iterations
medium_10rps   [  81% ] 011/080 VUs  1m36.9s/2m0s  10.00 iters/s

running (1m37.9s), 011/080 VUs, 969 complete and 0 interrupted iterations
medium_10rps   [  82% ] 011/080 VUs  1m37.9s/2m0s  10.00 iters/s

running (1m38.9s), 011/080 VUs, 979 complete and 0 interrupted iterations
medium_10rps   [  82% ] 011/080 VUs  1m38.9s/2m0s  10.00 iters/s

running (1m39.9s), 011/080 VUs, 989 complete and 0 interrupted iterations
medium_10rps   [  83% ] 011/080 VUs  1m39.9s/2m0s  10.00 iters/s

running (1m40.9s), 011/080 VUs, 999 complete and 0 interrupted iterations
medium_10rps   [  84% ] 011/080 VUs  1m40.9s/2m0s  10.00 iters/s

running (1m41.9s), 012/080 VUs, 1008 complete and 0 interrupted iterations
medium_10rps   [  85% ] 012/080 VUs  1m41.9s/2m0s  10.00 iters/s

running (1m42.9s), 011/080 VUs, 1019 complete and 0 interrupted iterations
medium_10rps   [  86% ] 011/080 VUs  1m42.9s/2m0s  10.00 iters/s

running (1m43.9s), 011/080 VUs, 1029 complete and 0 interrupted iterations
medium_10rps   [  87% ] 011/080 VUs  1m43.9s/2m0s  10.00 iters/s

running (1m44.9s), 011/080 VUs, 1039 complete and 0 interrupted iterations
medium_10rps   [  87% ] 011/080 VUs  1m44.9s/2m0s  10.00 iters/s

running (1m45.9s), 011/080 VUs, 1049 complete and 0 interrupted iterations
medium_10rps   [  88% ] 011/080 VUs  1m45.9s/2m0s  10.00 iters/s

running (1m46.9s), 011/080 VUs, 1059 complete and 0 interrupted iterations
medium_10rps   [  89% ] 011/080 VUs  1m46.9s/2m0s  10.00 iters/s

running (1m47.9s), 011/080 VUs, 1069 complete and 0 interrupted iterations
medium_10rps   [  90% ] 011/080 VUs  1m47.9s/2m0s  10.00 iters/s

running (1m48.9s), 011/080 VUs, 1079 complete and 0 interrupted iterations
medium_10rps   [  91% ] 011/080 VUs  1m48.9s/2m0s  10.00 iters/s

running (1m49.9s), 011/080 VUs, 1089 complete and 0 interrupted iterations
medium_10rps   [  92% ] 011/080 VUs  1m49.9s/2m0s  10.00 iters/s

running (1m50.9s), 011/080 VUs, 1099 complete and 0 interrupted iterations
medium_10rps   [  92% ] 011/080 VUs  1m50.9s/2m0s  10.00 iters/s

running (1m51.9s), 011/080 VUs, 1109 complete and 0 interrupted iterations
medium_10rps   [  93% ] 011/080 VUs  1m51.9s/2m0s  10.00 iters/s

running (1m52.9s), 011/080 VUs, 1119 complete and 0 interrupted iterations
medium_10rps   [  94% ] 011/080 VUs  1m52.9s/2m0s  10.00 iters/s

running (1m53.9s), 011/080 VUs, 1129 complete and 0 interrupted iterations
medium_10rps   [  95% ] 011/080 VUs  1m53.9s/2m0s  10.00 iters/s

running (1m54.9s), 012/080 VUs, 1138 complete and 0 interrupted iterations
medium_10rps   [  96% ] 012/080 VUs  1m54.9s/2m0s  10.00 iters/s

running (1m55.9s), 011/080 VUs, 1149 complete and 0 interrupted iterations
medium_10rps   [  97% ] 011/080 VUs  1m55.9s/2m0s  10.00 iters/s

running (1m56.9s), 011/080 VUs, 1159 complete and 0 interrupted iterations
medium_10rps   [  97% ] 011/080 VUs  1m56.9s/2m0s  10.00 iters/s

running (1m57.9s), 011/080 VUs, 1169 complete and 0 interrupted iterations
medium_10rps   [  98% ] 011/080 VUs  1m57.9s/2m0s  10.00 iters/s

running (1m58.9s), 011/080 VUs, 1179 complete and 0 interrupted iterations
medium_10rps   [  99% ] 011/080 VUs  1m58.9s/2m0s  10.00 iters/s

running (1m59.9s), 011/080 VUs, 1189 complete and 0 interrupted iterations
medium_10rps   [ 100% ] 011/080 VUs  1m59.9s/2m0s  10.00 iters/s

running (2m00.9s), 002/080 VUs, 1199 complete and 0 interrupted iterations
medium_10rps ↓ [ 100% ] 011/080 VUs  2m0s  10.00 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 3603    29.749763/s
    checks_succeeded...: 100.00% 3603 out of 3603
    checks_failed......: 0.00%   0 out of 3603

    ✓ presign status 200
    ✓ upload status 200 or 204
    ✓ create post status 200

    CUSTOM
    create_post_duration...........: avg=56.523284   min=21.976613 med=30.845794 max=1706.957795 p(90)=60.83155  p(95)=91.077346
    create_post_success............: 100.00% 1201 out of 1201
    image_completion_duration......: avg=1156.899251 min=1036      med=1049      max=5324        p(90)=1104      p(95)=1424     
    image_completion_success.......: 100.00% 1201 out of 1201
    image_upload_duration..........: avg=41.297193   min=27.439135 med=37.618277 max=105.895459  p(90)=55.880793 p(95)=60.1902  
    presign_duration...............: avg=8.192939    min=3.230616  med=4.619014  max=250.781343  p(90)=10.595503 p(95)=23.14445 

    HTTP
    http_req_duration..............: avg=40.47ms     min=3.23ms    med=12.03ms   max=2.46s       p(90)=48.21ms   p(95)=62.71ms  
      { expected_response:true }...: avg=40.47ms     min=3.23ms    med=12.03ms   max=2.46s       p(90)=48.21ms   p(95)=62.71ms  
    http_req_failed................: 0.00%   0 out of 6008
    http_reqs......................: 6008    49.607709/s

    EXECUTION
    iteration_duration.............: avg=1.21s       min=1.07s     med=1.09s     max=5.62s       p(90)=1.16s     p(95)=1.51s    
    iterations.....................: 1201    9.916588/s
    vus............................: 2       min=2            max=50
    vus_max........................: 80      min=80           max=80

    NETWORK
    data_received..................: 12 MB   98 kB/s
    data_sent......................: 156 MB  1.3 MB/s



running (2m01.1s), 000/080 VUs, 1201 complete and 0 interrupted iterations
medium_10rps ✓ [ 100% ] 000/080 VUs  2m0s  10.00 iters/s